phil971-kant-rational-agency.org
#+TITLE: PHIL 971 - Kant & Kantianism on Rational Agency
#+DATE: July 2, 2020
#+AUTHOR: Colin McLear
#+SELECT_TAGS: export
#+EXCLUDE_TAGS: noexport archive nohugo
#+TODO: TODO NEXT | DONE CANCELED
#+TODO: DRAFT | DONE CANCELED
#+LANGUAGE: en
#+LATEX_HEADER: \usepackage[English]{babel}
#+OPTIONS: '":t

*** DONE Kant on the Synthetic A Priori
SCHEDULED: <2020-08-18 Tue>
:PROPERTIES:
:EXPORT_HUGO_TAGS: judgment analytic/synthetic truth "a priori"
:EXPORT_FILE_NAME: kant-on-synthetic-a-priori
:EXPORT_HUGO_CUSTOM_FRONT_MATTER: :toc true :type post :nocite '(@allison1973 @allison2004 @beck1955 @beck1956 @beck1978d @beck1969 @gardner1999 @lovejoy1906a @vancleve1999 @proops2005 @hogan2013)
:END:
 
#  1.  The distinction between pure and empirical knowledge
#  2.  We have some items of a priori knowledge, and even the common
#      understanding is never without them
#  3.  Philosophy needs a science to show that there can be a priori
#      knowledge, and to establish its principles and its scope
#  4.  The difference between analytic and synthetic judgments
#  5.  All theoretical sciences of reason contain synthetic a priori
#      judgments as principles
#  6.  The general problem of pure reason
#  7.  The idea and division of a special science called ‘critique of pure
#      reason’

[[http://plato.stanford.edu/entries/kant/][Immanuel Kant]] (1724--1804) was the most significant German philosopher of the
eighteenth century, and was a key figure in the [[http://plato.stanford.edu/entries/kant/][Enlightenment]]. He wrote most
of his most famous philosophical works relatively late in his professional
life, having only achieved a permanent position as professor in 1770, at the
age of forty-six. From 1781 to 1798 Kant published a series of tremendously
influential philosophical works, including the /Critique of Pure Reason/
(1781/​7), the /Groundwork of the Metaphysics of Morals/ (1785), the /Metaphysical
Foundations of Natural Science/ (1786), the /Critique of Practical Reason/
(1788), and the /Critique of the Power of Judgment/ (1790).

We'll be primarily focusing on Kant's project in the /Critique of Pure Reason/,
as well as the moral philosophy of the /Groundwork for the Metaphysics of
Morals/ and the /Critique of Practical Reason/. There are certain aspects of
Kant's project in the /Critique of Pure Reason/ that should be very familiar to
those with knowledge of prominent European philosophers of the 17th and 18th
centuries. For example, like Descartes, Locke, and Hume, Kant wishes to
articulate the nature and extent of human knowledge, and to do so in a manner
which proceeds from an analysis of the nature of human cognitive capacities.
Kant believes that human reason requires a ‘critique'---a kind of process of
self-examination or scrutiny---as to whether it is fit to provide us with
knowledge. Kant ultimately argues that human reason is not fit to provide us
with knowledge of a mind-independent reality transcending human experience. In
this sense Kant is deeply sympathetic with ‘empiricist' critiques by Locke,
Berkeley, and Hume of ‘rationalist' philosophers such as Descartes and
Leibniz.

However, Kant also argues that we have much deeper and more extensive
knowledge of the world we experience (or could possibly experience) than his
empiricist predecessors would allow. For example, Kant argues that we have
knowledge of necessary truths concerning aspects of the empirical world (such
as that every event in the empirical world has a cause), as well as truths
which are universal in scope or extent. Thus Kant articulates a view that is
directly opposed to the kinds of skeptical arguments Hume discusses in his
/Treatise/ and first /Enquiry/.

Kant thus thinks that we have knowledge of the necessary and universal laws
governing the empirical world---or more simple, "nature"---while he
nevertheless argues that we are almost wholly ignorant of the fundamental
reality which underlies or grounds the existence of the natural world. In
this way Kant combines various aspects of both the traditional rationalist and
empiricist positions. Like Locke and Hume, Kant thinks we must realize that
the boundaries of human knowledge stop at experience, and thus that we must be
extraordinarily circumspect concerning any claim made about what reality is
like independent of all human experience. But, like Descartes and Leibniz,
Kant thinks that central parts of human knowledge nevertheless exhibit
characteristics of necessity and universality, and that, contrary to Hume's
skeptical arguments, we can have good reason to think that they do.

Kant thus critiques pure reason in order to show its nature and limits, and
thereby curb the pretensions of various metaphysical systems articulated on
the basis of a firm faith that reason alone allows us to scrutinize the very
depths of reality. But Kant also argues that the legitimate domain of reason
is more extensive and more substantive than previous empiricist critiques had
allowed. In this way Kant salvages much of the prevailing Enlightenment
conception of reason as an organ for knowledge of the world.

Below I characterize some of the central aspects of Kant's epistemological
framework and how that framework significantly revolutionized our
understanding of the possible nature and extent of human knowledge.

**** Human Knowledge

