phil971-kant-rational-agency.org
***** The A Priori

A variety of philosophers from the Early Modern period (e.g. Descartes,
Leibniz, Hume) argue that there are kinds of knowledge that may be had just by
thinking, and that such forms of knowledge are universal and necessary in
scope. Hume's conception of knowledge made this especially clear. According to
Hume, knowledge of necessary and universal truths must be purely a function of
knowledge of the relations of ideas.

Kant agrees with Hume that a priori knowledge is independent of experience. In
fact, he sees it as definitive of 'pure' a priori knowledge that it be
completely independent of experience in the sense that its content is neither
derived from experience not justified by experience in its application. He
contrasts such knowledge with 'empirical' knowledge or knowledge a posteriori.
A priori knowledge may be more or less 'pure' according to whether or not the
concepts which make it up are themselves a priori knowable. Kant uses the
example 'every alteration has a cause' as an example of /impure/ a priori
knowledge, since the concept <alteration> is empirical.

One important point about Kant's use of 'independent' in describing the a
priori. Kant does not think that a priori knowledge is independent of
experience in the sense that one need not have /any/ experience in order to have
knowledge. On the contrary, Kant thinks that /all/ of our knowledge depends on
our having experience of some kind or another, though he doesn't think this
dependence entails that all our judgments are ultimately /justified/ by
experience. This is why Kant says that

#+BEGIN_QUOTE
  But although all our cognition commences with experience, yet it does
  not on that account all arise from experience. (CPR B1)
#+END_QUOTE

There seems to be two reasons for Kant's thinking this. First, we need
experience in order for our cognitive faculties to function and develop.
Second, we may need particular experiences in order to acquire empirical
concepts (e.g. red experiences in order to acquire the concept <red>). This is
what distinguishes pure from impure a priori judgments. Impure a priori
judgments are partially constituted by concepts whose content is in some way
derived from content given by the senses.

If a priori knowledge is, for Kant, knowledge that is (in some sense to
be further specified) /independent/ of experience, that fact is not the
only mark or indicator that some bit of knowledge is a priori. In
addition, Kant argues, any bit of knowledge that is necessary and/or
universal in scope is itself a priori.

#+BEGIN_QUOTE
  Necessity and strict universality are therefore secure indications" of
  an a priori cognition, and also belong together inseparably. But since
  in their use it is sometimes easier to show the empirical limitation
  in judgments than the contingency in them, or is often more plausible
  to show the unrestricted universality that we ascribe to a judgment
  than its necessity, it is advisable to employ separately these two
  criteria, each of which is in itself infallible. (CPR B4)
#+END_QUOTE
  

Kant argues that this conception of a priori knowledge is presupposed in many
empirical judgments as well as in particular sciences. He specifically points
to mathematics ('5+7=12') and to physical judgments ('every alteration has a
cause'). One of Kant's arguments against Humean skepticism is that all of our
empirical knowledge (even that knowledge which we think we have
unproblematically) presupposes a priori knowledge, which itself requires that
there be legitimate use of pure a priori concepts (i.e. concepts which cannot be
derived from any sense impression).

Kant thinks that there are many examples of judgments which we claim to know a
priori, but he is interested primarily in a specific subset of those which
constitute the subject matter of /metaphysics/---viz. judgments concerning God,
the soul (or mind), and immortality. One of Kant's primary aims is to
determine whether metaphysical knowledge is possible, and if it is possible,
what the extent and nature of that knowledge might be. This is what it means
when Kant says that he wishes to set metaphysics "on the secure path of a
science" (e.g. Bxvi). Metaphysical knowledge is problematic, Kant argues,
because unlike other forms of a priori knowledge, such as logic and
mathematics, it is not at all obvious which metaphysical judgments are in fact
correct and thus known, and which are merely thought to be so. This is
exemplified, Kant thinks, by the contentious disputes in which philosophers
have long been involved. Kant provides the following memorable description of
the sad plight of metaphysics. 

#+BEGIN_QUOTE
In metaphysics we have to retrace our path countless times, because we find
that it does not lead where we want to go, and it is so far from reaching
unanimity in the assertions of its adherents that it is rather a battlefield,
and indeed one that appears to be especially determined for testing one's
powers in mock combat; on this battlefield no combatant has ever gained the
least bit of ground, nor has any been able to base any lasting possession on
his victory. Hence there is no doubt that up to now the procedure of
metaphysics has been a mere groping, and what is the worst, a groping among
mere concepts. (Bxiv-xiv)
#+END_QUOTE 

Kant thus hopes that, by giving a critique of reason, he can demonstrate the
extent to which metaphysics might count as a science. As a secure science it
would rest on a secure set of claims and no longer be a "groping among mere
concepts."

***** The Analytic/Synthetic Distinction

A judgment is known (or knowable) a priori if it is known (or knowable)
independently of experience. Kant thinks that this is not the only dimension
according to which one can analyze a judgment. Kant also argues that all
judgments, in addition to being classifiable as either a priori or a
posteriori (or empirical), may also be classified as being either [[http://plato.stanford.edu/entries/analytic-synthetic/][analytic or
synthetic]].

An analytic judgment is one in which the predicate is ‘contained' in the
concept. One way of understanding this notion of ‘containment' is via a claim
about meaning. Accordingly, analytic judgments are those whose truth is known
merely in virtue of knowing the meaning or content of the concepts
constituting the judgment. For example, in the judgment ‘All bachelors are
unmarried' the concept <unmarried> is part of the meaning of <bachelor> and so
the truth of the judgment is grasped just by knowing the relevant meanings or
contents of its component concepts.

Kant also introduces several other markers of analyticity. In total Kant
provides us with four different marks of analyticity. He says that in an
analytic judgment the predicate is

1. ‘contained' within the subject
2. ‘identical' with the subject
3. analytic judgments are ones which are ‘explicative' rather than
   ‘ampliative'
4. analytic judgments are those knowable by means of application of the
   principle of non-contradiction

Which, if any of these markers is best thought of as the main characteristic
of an analytic judgment? This is a disputed issue (cf. @anderson2005;
@proops2005), though certainly, in all cases Kant is thinking of ‘atomic'
judgments of subject-predicate form.

