content/notes/kant-on-synthetic-a-priori.md


### The Synthetic A Priori {#the-synthetic-a-priori}

Kant argues, in ways similar to Locke, Hume, and Leibniz, that analytic
judgments are knowable a priori. Staying with the ‘containment' metaphor,
since the predicate is contained in the subject of an analytic judgment, there
is no need to look beyond the judgment to the world (so to speak) in order to
determine the truth value of the judgment. In this Kant is obviously in
agreement with Locke, Hume, and Leibniz. Kant agrees with his empiricist
predecessors in claiming that all a posteriori judgments are synthetic. Since
the predicate is adding something new to the subject we must look beyond the
judgment to the world---what we can experience---in order that we might
determine the relevant judgments truth or falsity. In non-empirical cases
(like the bachelor example above) the judgment's truth is determined by the
meanings of the concepts constituting it.

Kant's main innovation to the a priori/posteriori and analytic/synthetic
schemas is to note that the analytic a priori and the synthetic a posteriori
do not necessarily exhaust the realm of possible judgments. Here he
essentially can be understood to deny that "Hume's Fork" is an adequate
representation of the structure of human knowledge. According to Kant, there
are also _synthetic a priori_ judgments that are possible. Kant argues that
causal judgments are a clear example.

> it is easy to show that in human cognition there actually are such
> necessary and in the strictest sense universal, thus pure a priori
> judgments. If one wants an example from the sciences, one need only
> look at all the propositions of mathematics; if one would have one
> from the commonest use of the understanding, the proposition that
> every alteration must have a cause will do; indeed in the latter the
> very concept of a cause so obviously contains the concept of a
> necessity of connection with an effect and a strict universality of
> rule that it would be entirely lost if one sought, as Hume did, to
> derive it from a frequent association of that which happens with that
> which precedes and a habit (thus a merely subjective necessity) of
> connecting representations arising from that association (CPR B4-5)

<!--quoteend-->

> Take the proposition: "Everything that happens has its cause." In the
> concept of something that happens, I think, to be sure, of an
> existence that was preceded by a time, etc., and from that analytic
> judgments can be drawn. But the concept of a cause lies entirely
> outside that concept, and indicates something different than the
> concept of what happens in general, and is therefore not contained in
> the latter representation at all. How then do I come to say something
> quite different about that which happens in general, and to cognize
> the concept of cause as belonging to it, indeed necessarily, even
> though not contained in it? What is the unknown=X here on which the
> understanding depends when it believes itself to discover beyond the
> concept of A a predicate that is foreign to it yet which it
> nevertheless believes to be connected with it? (CPR B13-14)

Kant argues here that our judgments concerning events presuppose that they do
not just _occur_ but are _caused to occur_, that we know this to be true
necessarily and universally, and that we have no explanation of this fact
unless the judgments we make in such cases are synthetic a priori judgments.
The question remains, however, just how such synthetic a priori judgments
could be possibly true, much less known to be so. What is it that could link
the concepts in a subject-predicate judgment such that the truth of the
judgment holds necessarily and universally, while its nevertheless being true
that the predicate is not contained in the subject of the judgment, and thus
that the judgment is not analytic?

> Now the entire final aim of our speculative a priori cognition rests
> on such synthetic, i.e., ampliative principles; for the analytic ones
> are, to be sure, most important and necessary, but only for
> attaining that distinctness of concepts which is requisite for a
> secure and extended synthesis as a really new acquisition (CPR B13-14)

Kant argues that we need to explain how synthetic a priori judgments are
possible, and that the explanation of the possibility of significant portions
of our knowledge rests on this, including mathematics and natural science, as
well as the very possibility of metaphysics.


### Mathematics and the Synthetic A Priori {#mathematics-and-the-synthetic-a-priori}

Recall that for Hume, mathematical knowledge was a function merely of
knowledge of relations of ideas, in other words, that math is analytic
and a priori. Kant disputes this. Our mathematical knowledge is
certainly a priori, he thinks, but it is not explained in terms of
relations of ideas or concepts (i.e. in terms of containment or any of
the other marks of analyticity). Instead, Kant argues that mathematical
knowledge must be _synthetic_, but since it is necessary and universal,
also _a priori_. Here's how Kant puts the point in his _Prolegomena_:

> The essential feature of pure mathematical cognition, differentiating
> it from all other a priori cognition, is that it must throughout
> proceed not from concepts, but always and only through the
> construction of concepts (Critique, p. 713). Because pure mathematical
> cognition, in its propositions, must therefore go beyond the concept
> to that which is contained in the intuition corresponding to it, its
> propositions can and must never arise through the analysis of
> concepts, i.e., analytically, and so are one and all synthetic.
> (_Prolegomena_ 4:272, p. 20)

Kant uses two examples in his argument concerning mathematics. The first
is the judgment '7+5=12' and the second is the geometric judgment that
'the shortest distance between two points is a straight line'. Though
both judgments are knowable a priori, Kant thinks that in neither of
these two cases can we explain the truth of the judgments analytically.

> One might well at first think: that the proposition 7 + 5 = 12 is a
> purely analytic proposition that follows from the concept of a sum of
> seven and five according to the principle of contradiction. However,
> upon closer inspection, one finds that the concept of the sum of 7 and
> 5 contains nothing further than the unification of the two numbers
> into one, through which by no means is thought what this single number
> may be that combines the two. The concept of twelve is in no way
> already thought because I merely think to myself this unification of
> seven and five, and I may analyze my concept of such a possible sum
> for as long as may be, still I will not meet with twelve therein.
> (_Prolegomena_ 4:268-9, p. 18)

Kant's argument here is that while it might be analytically true that
the sum of 7 and 5 is _a number_ (and also that it must be a _natural
number_), it is not clear from analysis alone that the sum is equal to
12, or any other pair of natural numbers which might sum to 12.

Kant seems to think that to the extent one finds the answer twelve
_obvious_ one is adverting, either explicitly or implicitly, to some
particular experience of adding units, such as counting on one's
fingers, or adding up objects (e.g. apples, chairs, blocks, etc.).

Also, if '7+5=12' is known analytically, then in thinking it one is
equivalently thinking of any or all the numbers which are equal to 12,
including _very large_ numbers (e.g. any numbers _m_ and _n_ which might yield 12).
This certainly doesn't reflect our experience when calculating such sums,
which may yield further evidence that the judgment isn't analytically true.
